; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob90) (:domain depot)
(:objects
	depot0 depot1 depot2 - depot
	distributor0 distributor1 distributor2 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 - crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 hoist9 hoist10 hoist11 hoist12 hoist13 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate6)
	(at pallet1 depot1)
	(clear crate1)
	(at pallet2 depot2)
	(clear crate4)
	(at pallet3 distributor0)
	(clear crate5)
	(at pallet4 distributor1)
	(clear crate0)
	(at pallet5 distributor2)
	(clear crate8)
	(at pallet6 distributor2)
	(clear crate7)
	(at pallet7 depot1)
	(clear crate9)
	(at pallet8 distributor2)
	(clear pallet8)
	(at pallet9 depot1)
	(clear pallet9)
	(at truck0 depot2)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 442)
	(at truck1 distributor2)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 367)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 distributor0)
	(available hoist6)
	(at hoist7 distributor2)
	(available hoist7)
	(at hoist8 depot0)
	(available hoist8)
	(at hoist9 depot0)
	(available hoist9)
	(at hoist10 depot0)
	(available hoist10)
	(at hoist11 distributor2)
	(available hoist11)
	(at hoist12 depot1)
	(available hoist12)
	(at hoist13 distributor1)
	(available hoist13)
	(at crate0 distributor1)
	(on crate0 pallet4)
	(= (weight crate0) 77)
	(at crate1 depot1)
	(on crate1 pallet1)
	(= (weight crate1) 55)
	(at crate2 depot2)
	(on crate2 pallet2)
	(= (weight crate2) 84)
	(at crate3 depot1)
	(on crate3 pallet7)
	(= (weight crate3) 20)
	(at crate4 depot2)
	(on crate4 crate2)
	(= (weight crate4) 19)
	(at crate5 distributor0)
	(on crate5 pallet3)
	(= (weight crate5) 93)
	(at crate6 depot0)
	(on crate6 pallet0)
	(= (weight crate6) 65)
	(at crate7 distributor2)
	(on crate7 pallet6)
	(= (weight crate7) 24)
	(at crate8 distributor2)
	(on crate8 pallet5)
	(= (weight crate8) 3)
	(at crate9 depot1)
	(on crate9 crate3)
	(= (weight crate9) 2)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 pallet4)
		(on crate1 crate2)
		(on crate2 pallet5)
		(on crate3 pallet8)
		(on crate4 crate7)
		(on crate5 pallet6)
		(on crate6 pallet1)
		(on crate7 pallet3)
		(on crate8 crate3)
		(on crate9 crate6)
	)
)

(:metric minimize (total-time)))

; plan
1. (lift hoist7 crate8 pallet5 distributor2)
   deleted: (at crate8 distributor2) (clear crate8) (available hoist7) (on crate8 pallet5)
   added: (lifting hoist7 crate8) (clear pallet5)
   changed: (fuel-cost) from 0 to 1
   goals met: 1 of 10
2. (load hoist7 crate8 truck1 distributor2)
   deleted: (lifting hoist7 crate8)
   added: (in crate8 truck1) (available hoist7)
   changed: (current_load truck1) from 0 to 3
   goals met: 1 of 10
3. (drive truck1 distributor2 depot1)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot1)
   changed: (fuel-cost) from 1 to 11
   goals met: 1 of 10
4. (lift hoist12 crate1 pallet1 depot1)
   deleted: (at crate1 depot1) (clear crate1) (available hoist12) (on crate1 pallet1)
   added: (lifting hoist12 crate1) (clear pallet1)
   changed: (fuel-cost) from 11 to 12
   goals met: 1 of 10
5. (lift hoist11 crate7 pallet6 distributor2)
   deleted: (at crate7 distributor2) (clear crate7) (available hoist11) (on crate7 pallet6)
   added: (lifting hoist11 crate7) (clear pallet6)
   changed: (fuel-cost) from 12 to 13
   goals met: 1 of 10
6. (lift hoist3 crate5 pallet3 distributor0)
   deleted: (at crate5 distributor0) (clear crate5) (available hoist3) (on crate5 pallet3)
   added: (lifting hoist3 crate5) (clear pallet3)
   changed: (fuel-cost) from 13 to 14
   goals met: 1 of 10
7. (drive truck0 depot2 distributor0)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 14 to 24
   goals met: 1 of 10
8. (load hoist12 crate1 truck1 depot1)
   deleted: (lifting hoist12 crate1)
   added: (in crate1 truck1) (available hoist12)
   changed: (current_load truck1) from 3 to 58
   goals met: 1 of 10
9. (unload hoist12 crate8 truck1 depot1)
   deleted: (in crate8 truck1) (available hoist12)
   added: (lifting hoist12 crate8)
   changed: (current_load truck1) from 58 to 55
   goals met: 1 of 10
10. (load hoist3 crate5 truck0 distributor0)
   deleted: (lifting hoist3 crate5)
   added: (in crate5 truck0) (available hoist3)
   changed: (current_load truck0) from 0 to 93
   goals met: 1 of 10
11. (drive truck0 distributor0 depot1)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot1)
   changed: (fuel-cost) from 24 to 34
   goals met: 1 of 10
12. (drive truck1 depot1 depot2)
   deleted: (at truck1 depot1)
   added: (at truck1 depot2)
   changed: (fuel-cost) from 34 to 44
   goals met: 1 of 10
13. (load hoist12 crate8 truck0 depot1)
   deleted: (lifting hoist12 crate8)
   added: (in crate8 truck0) (available hoist12)
   changed: (current_load truck0) from 93 to 96
   goals met: 1 of 10
14. (lift hoist12 crate9 crate3 depot1)
   deleted: (at crate9 depot1) (clear crate9) (available hoist12) (on crate9 crate3)
   added: (lifting hoist12 crate9) (clear crate3)
   changed: (fuel-cost) from 44 to 45
   goals met: 1 of 10
15. (load hoist12 crate9 truck0 depot1)
   deleted: (lifting hoist12 crate9)
   added: (in crate9 truck0) (available hoist12)
   changed: (current_load truck0) from 96 to 98
   goals met: 1 of 10
16. (drop hoist11 crate7 pallet6 distributor2)
   deleted: (lifting hoist11 crate7) (clear pallet6)
   added: (available hoist11) (at crate7 distributor2) (clear crate7) (on crate7 pallet6)
   goals met: 1 of 10
17. (lift hoist5 crate7 pallet6 distributor2)
   deleted: (at crate7 distributor2) (clear crate7) (available hoist5) (on crate7 pallet6)
   added: (lifting hoist5 crate7) (clear pallet6)
   changed: (fuel-cost) from 45 to 46
   goals met: 1 of 10
18. (lift hoist1 crate3 pallet7 depot1)
   deleted: (at crate3 depot1) (clear crate3) (available hoist1) (on crate3 pallet7)
   added: (lifting hoist1 crate3) (clear pallet7)
   changed: (fuel-cost) from 46 to 47
   goals met: 1 of 10
19. (unload hoist12 crate8 truck0 depot1)
   deleted: (in crate8 truck0) (available hoist12)
   added: (lifting hoist12 crate8)
   changed: (current_load truck0) from 98 to 95
   goals met: 1 of 10
20. (lift hoist2 crate4 crate2 depot2)
   deleted: (at crate4 depot2) (clear crate4) (available hoist2) (on crate4 crate2)
   added: (lifting hoist2 crate4) (clear crate2)
   changed: (fuel-cost) from 47 to 48
   goals met: 1 of 10
21. (load hoist2 crate4 truck1 depot2)
   deleted: (lifting hoist2 crate4)
   added: (in crate4 truck1) (available hoist2)
   changed: (current_load truck1) from 55 to 74
   goals met: 1 of 10
22. (drop hoist5 crate7 pallet6 distributor2)
   deleted: (lifting hoist5 crate7) (clear pallet6)
   added: (available hoist5) (at crate7 distributor2) (clear crate7) (on crate7 pallet6)
   goals met: 1 of 10
23. (drive truck0 depot1 depot0)
   deleted: (at truck0 depot1)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 48 to 58
   goals met: 1 of 10
24. (lift hoist2 crate2 pallet2 depot2)
   deleted: (at crate2 depot2) (clear crate2) (available hoist2) (on crate2 pallet2)
   added: (lifting hoist2 crate2) (clear pallet2)
   changed: (fuel-cost) from 58 to 59
   goals met: 1 of 10
25. (unload hoist8 crate9 truck0 depot0)
   deleted: (in crate9 truck0) (available hoist8)
   added: (lifting hoist8 crate9)
   changed: (current_load truck0) from 95 to 93
   goals met: 1 of 10
26. (drop hoist1 crate3 pallet1 depot1)
   deleted: (lifting hoist1 crate3) (clear pallet1)
   added: (available hoist1) (at crate3 depot1) (clear crate3) (on crate3 pallet1)
   goals met: 1 of 10
27. (lift hoist5 crate7 pallet6 distributor2)
   deleted: (at crate7 distributor2) (clear crate7) (available hoist5) (on crate7 pallet6)
   added: (lifting hoist5 crate7) (clear pallet6)
   changed: (fuel-cost) from 59 to 60
   goals met: 1 of 10
28. (drive truck0 depot0 distributor2)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor2)
   changed: (fuel-cost) from 60 to 70
   goals met: 1 of 10
29. (unload hoist7 crate5 truck0 distributor2)
   deleted: (in crate5 truck0) (available hoist7)
   added: (lifting hoist7 crate5)
   changed: (current_load truck0) from 93 to 0
   goals met: 1 of 10
30. (drop hoist8 crate9 crate6 depot0)
   deleted: (lifting hoist8 crate9) (clear crate6)
   added: (available hoist8) (at crate9 depot0) (clear crate9) (on crate9 crate6)
   goals met: 2 of 10
31. (drop hoist7 crate5 pallet6 distributor2)
   deleted: (lifting hoist7 crate5) (clear pallet6)
   added: (available hoist7) (at crate5 distributor2) (clear crate5) (on crate5 pallet6)
   goals met: 3 of 10
32. (drop hoist2 crate2 pallet2 depot2)
   deleted: (lifting hoist2 crate2) (clear pallet2)
   added: (available hoist2) (at crate2 depot2) (clear crate2) (on crate2 pallet2)
   goals met: 3 of 10
33. (unload hoist2 crate1 truck1 depot2)
   deleted: (in crate1 truck1) (available hoist2)
   added: (lifting hoist2 crate1)
   changed: (current_load truck1) from 74 to 19
   goals met: 3 of 10
34. (lift hoist10 crate9 crate6 depot0)
   deleted: (at crate9 depot0) (clear crate9) (available hoist10) (on crate9 crate6)
   added: (lifting hoist10 crate9) (clear crate6)
   changed: (fuel-cost) from 70 to 71
   goals met: 2 of 10
35. (drive truck1 depot2 distributor2)
   deleted: (at truck1 depot2)
   added: (at truck1 distributor2)
   changed: (fuel-cost) from 71 to 81
   goals met: 2 of 10
36. (unload hoist11 crate4 truck1 distributor2)
   deleted: (in crate4 truck1) (available hoist11)
   added: (lifting hoist11 crate4)
   changed: (current_load truck1) from 19 to 0
   goals met: 2 of 10
37. (drop hoist5 crate7 crate5 distributor2)
   deleted: (lifting hoist5 crate7) (clear crate5)
   added: (available hoist5) (at crate7 distributor2) (clear crate7) (on crate7 crate5)
   goals met: 2 of 10
38. (lift hoist9 crate6 pallet0 depot0)
   deleted: (at crate6 depot0) (clear crate6) (available hoist9) (on crate6 pallet0)
   added: (lifting hoist9 crate6) (clear pallet0)
   changed: (fuel-cost) from 81 to 82
   goals met: 2 of 10
39. (drive truck1 distributor2 depot2)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot2)
   changed: (fuel-cost) from 82 to 92
   goals met: 2 of 10
40. (drop hoist9 crate6 pallet0 depot0)
   deleted: (lifting hoist9 crate6) (clear pallet0)
   added: (available hoist9) (at crate6 depot0) (clear crate6) (on crate6 pallet0)
   goals met: 2 of 10
41. (drop hoist10 crate9 crate6 depot0)
   deleted: (lifting hoist10 crate9) (clear crate6)
   added: (available hoist10) (at crate9 depot0) (clear crate9) (on crate9 crate6)
   goals met: 3 of 10
42. (drive truck0 distributor2 depot1)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot1)
   changed: (fuel-cost) from 92 to 102
   goals met: 3 of 10
43. (lift hoist9 crate9 crate6 depot0)
   deleted: (at crate9 depot0) (clear crate9) (available hoist9) (on crate9 crate6)
   added: (lifting hoist9 crate9) (clear crate6)
   changed: (fuel-cost) from 102 to 103
   goals met: 2 of 10
44. (lift hoist8 crate6 pallet0 depot0)
   deleted: (at crate6 depot0) (clear crate6) (available hoist8) (on crate6 pallet0)
   added: (lifting hoist8 crate6) (clear pallet0)
   changed: (fuel-cost) from 103 to 104
   goals met: 2 of 10
45. (drive truck0 depot1 depot0)
   deleted: (at truck0 depot1)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 104 to 114
   goals met: 2 of 10
46. (drop hoist11 crate4 crate7 distributor2)
   deleted: (lifting hoist11 crate4) (clear crate7)
   added: (available hoist11) (at crate4 distributor2) (clear crate4) (on crate4 crate7)
   goals met: 3 of 10
47. (drive truck1 depot2 distributor2)
   deleted: (at truck1 depot2)
   added: (at truck1 distributor2)
   changed: (fuel-cost) from 114 to 124
   goals met: 3 of 10
48. (drop hoist12 crate8 crate3 depot1)
   deleted: (lifting hoist12 crate8) (clear crate3)
   added: (available hoist12) (at crate8 depot1) (clear crate8) (on crate8 crate3)
   goals met: 4 of 10
49. (lift hoist1 crate8 crate3 depot1)
   deleted: (at crate8 depot1) (clear crate8) (available hoist1) (on crate8 crate3)
   added: (lifting hoist1 crate8) (clear crate3)
   changed: (fuel-cost) from 124 to 125
   goals met: 3 of 10
50. (drive truck0 depot0 depot2)
   deleted: (at truck0 depot0)
   added: (at truck0 depot2)
   changed: (fuel-cost) from 125 to 135
   goals met: 3 of 10
51. (load hoist2 crate1 truck0 depot2)
   deleted: (lifting hoist2 crate1)
   added: (in crate1 truck0) (available hoist2)
   changed: (current_load truck0) from 0 to 55
   goals met: 3 of 10
52. (lift hoist12 crate3 pallet1 depot1)
   deleted: (at crate3 depot1) (clear crate3) (available hoist12) (on crate3 pallet1)
   added: (lifting hoist12 crate3) (clear pallet1)
   changed: (fuel-cost) from 135 to 136
   goals met: 3 of 10
53. (lift hoist2 crate2 pallet2 depot2)
   deleted: (at crate2 depot2) (clear crate2) (available hoist2) (on crate2 pallet2)
   added: (lifting hoist2 crate2) (clear pallet2)
   changed: (fuel-cost) from 136 to 137
   goals met: 3 of 10
54. (load hoist2 crate2 truck0 depot2)
   deleted: (lifting hoist2 crate2)
   added: (in crate2 truck0) (available hoist2)
   changed: (current_load truck0) from 55 to 139
   goals met: 3 of 10
55. (drive truck0 depot2 distributor2)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor2)
   changed: (fuel-cost) from 137 to 147
   goals met: 3 of 10
56. (unload hoist5 crate2 truck0 distributor2)
   deleted: (in crate2 truck0) (available hoist5)
   added: (lifting hoist5 crate2)
   changed: (current_load truck0) from 139 to 55
   goals met: 3 of 10
57. (drop hoist5 crate2 pallet5 distributor2)
   deleted: (lifting hoist5 crate2) (clear pallet5)
   added: (available hoist5) (at crate2 distributor2) (clear crate2) (on crate2 pallet5)
   goals met: 4 of 10
58. (unload hoist11 crate1 truck0 distributor2)
   deleted: (in crate1 truck0) (available hoist11)
   added: (lifting hoist11 crate1)
   changed: (current_load truck0) from 55 to 0
   goals met: 4 of 10
59. (drop hoist11 crate1 crate2 distributor2)
   deleted: (lifting hoist11 crate1) (clear crate2)
   added: (available hoist11) (at crate1 distributor2) (clear crate1) (on crate1 crate2)
   goals met: 5 of 10
60. (drop hoist8 crate6 pallet0 depot0)
   deleted: (lifting hoist8 crate6) (clear pallet0)
   added: (available hoist8) (at crate6 depot0) (clear crate6) (on crate6 pallet0)
   goals met: 5 of 10
61. (drop hoist9 crate9 crate6 depot0)
   deleted: (lifting hoist9 crate9) (clear crate6)
   added: (available hoist9) (at crate9 depot0) (clear crate9) (on crate9 crate6)
   goals met: 6 of 10
62. (lift hoist0 crate9 crate6 depot0)
   deleted: (at crate9 depot0) (clear crate9) (available hoist0) (on crate9 crate6)
   added: (lifting hoist0 crate9) (clear crate6)
   changed: (fuel-cost) from 147 to 148
   goals met: 5 of 10
63. (lift hoist5 crate4 crate7 distributor2)
   deleted: (at crate4 distributor2) (clear crate4) (available hoist5) (on crate4 crate7)
   added: (lifting hoist5 crate4) (clear crate7)
   changed: (fuel-cost) from 148 to 149
   goals met: 4 of 10
64. (drop hoist12 crate3 pallet1 depot1)
   deleted: (lifting hoist12 crate3) (clear pallet1)
   added: (available hoist12) (at crate3 depot1) (clear crate3) (on crate3 pallet1)
   goals met: 4 of 10
65. (lift hoist8 crate6 pallet0 depot0)
   deleted: (at crate6 depot0) (clear crate6) (available hoist8) (on crate6 pallet0)
   added: (lifting hoist8 crate6) (clear pallet0)
   changed: (fuel-cost) from 149 to 150
   goals met: 4 of 10
66. (drive truck1 distributor2 depot0)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 150 to 160
   goals met: 4 of 10
67. (lift hoist7 crate7 crate5 distributor2)
   deleted: (at crate7 distributor2) (clear crate7) (available hoist7) (on crate7 crate5)
   added: (lifting hoist7 crate7) (clear crate5)
   changed: (fuel-cost) from 160 to 161
   goals met: 4 of 10
68. (drop hoist8 crate6 pallet0 depot0)
   deleted: (lifting hoist8 crate6) (clear pallet0)
   added: (available hoist8) (at crate6 depot0) (clear crate6) (on crate6 pallet0)
   goals met: 4 of 10
69. (drop hoist0 crate9 crate6 depot0)
   deleted: (lifting hoist0 crate9) (clear crate6)
   added: (available hoist0) (at crate9 depot0) (clear crate9) (on crate9 crate6)
   goals met: 5 of 10
70. (lift hoist8 crate9 crate6 depot0)
   deleted: (at crate9 depot0) (clear crate9) (available hoist8) (on crate9 crate6)
   added: (lifting hoist8 crate9) (clear crate6)
   changed: (fuel-cost) from 161 to 162
   goals met: 4 of 10
71. (lift hoist10 crate6 pallet0 depot0)
   deleted: (at crate6 depot0) (clear crate6) (available hoist10) (on crate6 pallet0)
   added: (lifting hoist10 crate6) (clear pallet0)
   changed: (fuel-cost) from 162 to 163
   goals met: 4 of 10
72. (drive truck1 depot0 depot1)
   deleted: (at truck1 depot0)
   added: (at truck1 depot1)
   changed: (fuel-cost) from 163 to 173
   goals met: 4 of 10
73. (drive truck0 distributor2 depot1)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot1)
   changed: (fuel-cost) from 173 to 183
   goals met: 4 of 10
74. (lift hoist12 crate3 pallet1 depot1)
   deleted: (at crate3 depot1) (clear crate3) (available hoist12) (on crate3 pallet1)
   added: (lifting hoist12 crate3) (clear pallet1)
   changed: (fuel-cost) from 183 to 184
   goals met: 4 of 10
75. (load hoist12 crate3 truck1 depot1)
   deleted: (lifting hoist12 crate3)
   added: (in crate3 truck1) (available hoist12)
   changed: (current_load truck1) from 0 to 20
   goals met: 4 of 10
76. (load hoist1 crate8 truck1 depot1)
   deleted: (lifting hoist1 crate8)
   added: (in crate8 truck1) (available hoist1)
   changed: (current_load truck1) from 20 to 23
   goals met: 4 of 10
77. (drive truck1 depot1 distributor2)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor2)
   changed: (fuel-cost) from 184 to 194
   goals met: 4 of 10
78. (unload hoist11 crate3 truck1 distributor2)
   deleted: (in crate3 truck1) (available hoist11)
   added: (lifting hoist11 crate3)
   changed: (current_load truck1) from 23 to 3
   goals met: 4 of 10
79. (drop hoist11 crate3 pallet8 distributor2)
   deleted: (lifting hoist11 crate3) (clear pallet8)
   added: (available hoist11) (at crate3 distributor2) (clear crate3) (on crate3 pallet8)
   goals met: 5 of 10
80. (unload hoist11 crate8 truck1 distributor2)
   deleted: (in crate8 truck1) (available hoist11)
   added: (lifting hoist11 crate8)
   changed: (current_load truck1) from 3 to 0
   goals met: 5 of 10
81. (drop hoist11 crate8 crate3 distributor2)
   deleted: (lifting hoist11 crate8) (clear crate3)
   added: (available hoist11) (at crate8 distributor2) (clear crate8) (on crate8 crate3)
   goals met: 6 of 10
82. (drop hoist10 crate6 pallet0 depot0)
   deleted: (lifting hoist10 crate6) (clear pallet0)
   added: (available hoist10) (at crate6 depot0) (clear crate6) (on crate6 pallet0)
   goals met: 6 of 10
83. (drop hoist8 crate9 crate6 depot0)
   deleted: (lifting hoist8 crate9) (clear crate6)
   added: (available hoist8) (at crate9 depot0) (clear crate9) (on crate9 crate6)
   goals met: 7 of 10
84. (drop hoist7 crate7 crate8 distributor2)
   deleted: (lifting hoist7 crate7) (clear crate8)
   added: (available hoist7) (at crate7 distributor2) (clear crate7) (on crate7 crate8)
   goals met: 7 of 10
85. (drive truck0 depot1 depot0)
   deleted: (at truck0 depot1)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 194 to 204
   goals met: 7 of 10
86. (lift hoist10 crate9 crate6 depot0)
   deleted: (at crate9 depot0) (clear crate9) (available hoist10) (on crate9 crate6)
   added: (lifting hoist10 crate9) (clear crate6)
   changed: (fuel-cost) from 204 to 205
   goals met: 6 of 10
87. (lift hoist0 crate6 pallet0 depot0)
   deleted: (at crate6 depot0) (clear crate6) (available hoist0) (on crate6 pallet0)
   added: (lifting hoist0 crate6) (clear pallet0)
   changed: (fuel-cost) from 205 to 206
   goals met: 6 of 10
88. (lift hoist7 crate7 crate8 distributor2)
   deleted: (at crate7 distributor2) (clear crate7) (available hoist7) (on crate7 crate8)
   added: (lifting hoist7 crate7) (clear crate8)
   changed: (fuel-cost) from 206 to 207
   goals met: 6 of 10
89. (drop hoist7 crate7 crate5 distributor2)
   deleted: (lifting hoist7 crate7) (clear crate5)
   added: (available hoist7) (at crate7 distributor2) (clear crate7) (on crate7 crate5)
   goals met: 6 of 10
90. (drop hoist5 crate4 crate7 distributor2)
   deleted: (lifting hoist5 crate4) (clear crate7)
   added: (available hoist5) (at crate4 distributor2) (clear crate4) (on crate4 crate7)
   goals met: 7 of 10
91. (drive truck0 depot0 depot1)
   deleted: (at truck0 depot0)
   added: (at truck0 depot1)
   changed: (fuel-cost) from 207 to 217
   goals met: 7 of 10
92. (drive truck1 distributor2 depot0)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 217 to 227
   goals met: 7 of 10
93. (lift hoist11 crate4 crate7 distributor2)
   deleted: (at crate4 distributor2) (clear crate4) (available hoist11) (on crate4 crate7)
   added: (lifting hoist11 crate4) (clear crate7)
   changed: (fuel-cost) from 227 to 228
   goals met: 6 of 10
94. (drive truck0 depot1 distributor2)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor2)
   changed: (fuel-cost) from 228 to 238
   goals met: 6 of 10
95. (lift hoist7 crate7 crate5 distributor2)
   deleted: (at crate7 distributor2) (clear crate7) (available hoist7) (on crate7 crate5)
   added: (lifting hoist7 crate7) (clear crate5)
   changed: (fuel-cost) from 238 to 239
   goals met: 6 of 10
96. (load hoist7 crate7 truck0 distributor2)
   deleted: (lifting hoist7 crate7)
   added: (in crate7 truck0) (available hoist7)
   changed: (current_load truck0) from 0 to 24
   goals met: 6 of 10
97. (drive truck0 distributor2 distributor0)
   deleted: (at truck0 distributor2)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 239 to 249
   goals met: 6 of 10
98. (drive truck1 depot0 distributor2)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor2)
   changed: (fuel-cost) from 249 to 259
   goals met: 6 of 10
99. (unload hoist3 crate7 truck0 distributor0)
   deleted: (in crate7 truck0) (available hoist3)
   added: (lifting hoist3 crate7)
   changed: (current_load truck0) from 24 to 0
   goals met: 6 of 10
100. (drop hoist3 crate7 pallet3 distributor0)
   deleted: (lifting hoist3 crate7) (clear pallet3)
   added: (available hoist3) (at crate7 distributor0) (clear crate7) (on crate7 pallet3)
   goals met: 7 of 10
101. (load hoist11 crate4 truck1 distributor2)
   deleted: (lifting hoist11 crate4)
   added: (in crate4 truck1) (available hoist11)
   changed: (current_load truck1) from 0 to 19
   goals met: 7 of 10
102. (drive truck1 distributor2 distributor0)
   deleted: (at truck1 distributor2)
   added: (at truck1 distributor0)
   changed: (fuel-cost) from 259 to 269
   goals met: 7 of 10
103. (unload hoist3 crate4 truck1 distributor0)
   deleted: (in crate4 truck1) (available hoist3)
   added: (lifting hoist3 crate4)
   changed: (current_load truck1) from 19 to 0
   goals met: 7 of 10
104. (drop hoist3 crate4 crate7 distributor0)
   deleted: (lifting hoist3 crate4) (clear crate7)
   added: (available hoist3) (at crate4 distributor0) (clear crate4) (on crate4 crate7)
   goals met: 8 of 10
105. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 269 to 279
   goals met: 8 of 10
106. (drop hoist0 crate6 pallet0 depot0)
   deleted: (lifting hoist0 crate6) (clear pallet0)
   added: (available hoist0) (at crate6 depot0) (clear crate6) (on crate6 pallet0)
   goals met: 8 of 10
107. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 279 to 289
   goals met: 8 of 10
108. (lift hoist0 crate6 pallet0 depot0)
   deleted: (at crate6 depot0) (clear crate6) (available hoist0) (on crate6 pallet0)
   added: (lifting hoist0 crate6) (clear pallet0)
   changed: (fuel-cost) from 289 to 290
   goals met: 8 of 10
109. (load hoist0 crate6 truck0 depot0)
   deleted: (lifting hoist0 crate6)
   added: (in crate6 truck0) (available hoist0)
   changed: (current_load truck0) from 0 to 65
   goals met: 8 of 10
110. (drive truck0 depot0 depot1)
   deleted: (at truck0 depot0)
   added: (at truck0 depot1)
   changed: (fuel-cost) from 290 to 300
   goals met: 8 of 10
111. (unload hoist12 crate6 truck0 depot1)
   deleted: (in crate6 truck0) (available hoist12)
   added: (lifting hoist12 crate6)
   changed: (current_load truck0) from 65 to 0
   goals met: 8 of 10
112. (drop hoist12 crate6 pallet1 depot1)
   deleted: (lifting hoist12 crate6) (clear pallet1)
   added: (available hoist12) (at crate6 depot1) (clear crate6) (on crate6 pallet1)
   goals met: 9 of 10
113. (load hoist10 crate9 truck1 depot0)
   deleted: (lifting hoist10 crate9)
   added: (in crate9 truck1) (available hoist10)
   changed: (current_load truck1) from 0 to 2
   goals met: 9 of 10
114. (drive truck1 depot0 depot1)
   deleted: (at truck1 depot0)
   added: (at truck1 depot1)
   changed: (fuel-cost) from 300 to 310
   goals met: 9 of 10
115. (unload hoist1 crate9 truck1 depot1)
   deleted: (in crate9 truck1) (available hoist1)
   added: (lifting hoist1 crate9)
   changed: (current_load truck1) from 2 to 0
   goals met: 9 of 10
116. (drop hoist1 crate9 crate6 depot1)
   deleted: (lifting hoist1 crate9) (clear crate6)
   added: (available hoist1) (at crate9 depot1) (clear crate9) (on crate9 crate6)
   goals met: 10 of 10
